#!/bin/bash

# =========================================================
# ansible 2.10.7 가상환경 활성화
# =========================================================
cd ~/project/infra-proxmox/ansible
source ansible-2.10/bin/activate

echo "✅ 가상환경 ansible 2.10.7 실행 완료"

# =========================================================
# 버전 확인
# =========================================================
ansible --version

# =========================================================
# Playbook 실행
# =========================================================
echo "🚀 ansible playbook 실행 중 -------"

ansible-playbook ./playbook.yml

echo "✅ ansible playbook 실행 완료 -------"